{"config": [{"config": {"dtype": "float32", "batch_input_shape": [null, 3, 13], "name": "masking_1", "trainable": true, "mask_value": -1}, "class_name": "Masking"}, {"config": {"use_bias": true, "kernel_regularizer": null, "implementation": 1, "activation": "tanh", "dropout": 0.2, "trainable": true, "unroll": false, "return_sequences": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "batch_input_shape": [null, 3, 13], "go_backwards": false, "return_state": false, "stateful": false, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "units": 32}, "class_name": "LSTM"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 32], "bias_regularizer": null, "units": 7}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow"}