{"keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "name": "masking_1", "mask_value": -1, "dtype": "float32", "batch_input_shape": [null, 3, 40]}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "stateful": false, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 3, 40], "recurrent_regularizer": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": false, "dropout": 0.0, "return_state": false, "unroll": false, "go_backwards": false, "units": 32, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "trainable": true, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "batch_input_shape": [null, 32], "activity_regularizer": null, "units": 23, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "backend": "tensorflow"}